SoapTest/soap_config/35.create_group_account.txt

<?xml version="1.0" encoding="UTF-8"?>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Body>

<SubmitRequest xmlns="http://alcatel-lucent.com/esm/ws/svcmgr/V2_0">
    <SessionInfo>
        <sessionId>%s</sessionId>
    </SessionInfo>

    <RequestInfo>
        <ReqID></ReqID>
    </RequestInfo>

    <NERoutingInfo>
        <NeGroupName>inasgrp</NeGroupName>
    </NERoutingInfo>

    <TaskList>
        <Task>
            <Name>Create Group Account</Name>
            <ParamList>
                <Param>
                    <Name>Group ID</Name>
                    <Value>group7</Value>
                </Param>
                <Param>
                    <Name>COSP ID</Name>
                    <Value>P4G1510300</Value>
                </Param>
                <Param>
                    <Name>Owner Name</Name>
                    <Value>corc</Value>
                </Param>
                <Param>
                    <Name>Currency Label</Name>
                    <Value>NTD</Value>
                </Param>
                <Param>
                    <Name>Provider ID</Name>
                    <Value>2000</Value>
                </Param>
                <Param>
                    <Name>Prepaid User</Name>
                    <Value>Y</Value>
                </Param>
                <Param>
                    <Name>SCP Name</Name>
                    <Value>OCS107</Value>
                </Param>
                <Param>
                    <Name>Language Label</Name>
                    <Value>en_01</Value>
                </Param>
                <Param>
                    <Name>Balance Transfer Allowed</Name>
                    <Value>Y</Value>
                </Param>
                <Param>
                    <Name>Transaction ID</Name>
                    <Value>MsgSoap035</Value>
                </Param>
            </ParamList>
        </Task>
    </TaskList>
</SubmitRequest>

</S:Body>
</S:Envelope>

